results/lgtm/normal-load/K6Queries.txt
     ✓ PromQL status 200
     ✓ LogQL status 200
     ✓ Trace status 200

     checks.........................: 100.00% ✓ 186                 ✗ 0
     data_received..................: 2.4 MB  633 B/s
     data_sent......................: 37 kB   9.927853008580698 B/s
     http_req_blocked...............: avg=155.46µs   min=4.73µs   med=6.4µs      max=20.85ms    p(90)=7.96µs     p(95)=8.58µs
     http_req_connecting............: avg=7.22µs     min=0s       med=0s         max=441.71µs   p(90)=0s         p(95)=0s
     http_req_duration..............: avg=85.83ms    min=826.06µs med=23.58ms    max=687.1ms    p(90)=334.23ms   p(95)=416.99ms
       { expected_response:true }...: avg=85.83ms    min=826.06µs med=23.58ms    max=687.1ms    p(90)=334.23ms   p(95)=416.99ms
   ✓ http_req_failed................: 0.00%   ✓ 0                   ✗ 186
     http_req_receiving.............: avg=257.36µs   min=56.44µs  med=105.5µs    max=11.35ms    p(90)=439.99µs   p(95)=538.03µs
     http_req_sending...............: avg=33.86µs    min=18.36µs  med=32.41µs    max=97.01µs    p(90)=42.33µs    p(95)=48.84µs
     http_req_tls_handshaking.......: avg=0s         min=0s       med=0s         max=0s         p(90)=0s         p(95)=0s
     http_req_waiting...............: avg=85.54ms    min=718.63µs med=23.09ms    max=686.97ms   p(90)=334.11ms   p(95)=416.85ms
     http_reqs......................: 186     0.049972/s
     iteration_duration.............: avg=1m0s       min=1m0s     med=1m0s       max=1m0s       p(90)=1m0s       p(95)=1m0s
     iterations.....................: 61      0.016389/s
   ✓ logql_query_duration_ms........: avg=32.388688  min=8.057967 med=25.331549  max=437.333784 p(90)=35.875588  p(95)=40.762354
   ✓ promql_query_duration_ms.......: avg=1.093752   min=0.826068 med=1.035374   max=2.598132   p(90)=1.329364   p(95)=1.427969
   ✓ trace_query_duration_ms........: avg=224.011817 min=3.821279 med=186.201206 max=687.103246 p(90)=445.605247 p(95)=521.461162
     vus............................: 1       min=1                 max=1
     vus_max........................: 1       min=1                 max=1